In [1]:
import numpy as np
import pandas as pd
import datetime

In [3]:
df = pd.read_csv('datasets/time_series.csv')
df.head()

   ID          Datetime  Count
0   0  25-08-2012 00:00      8
1   1  25-08-2012 01:00      2
2   2  25-08-2012 02:00      6
3   3  25-08-2012 03:00      2
4   4  25-08-2012 04:00      2

In [4]:
df['Datetime_format'] = pd.to_datetime(df['Datetime'])
df.head()

   ID          Datetime  Count     Datetime_format
0   0  25-08-2012 00:00      8 2012-08-25 00:00:00
1   1  25-08-2012 01:00      2 2012-08-25 01:00:00
2   2  25-08-2012 02:00      6 2012-08-25 02:00:00
3   3  25-08-2012 03:00      2 2012-08-25 03:00:00
4   4  25-08-2012 04:00      2 2012-08-25 04:00:00

In [5]:
df.dtypes

ID                          int64
Datetime                   object
Count                       int64
Datetime_format    datetime64[ns]
dtype: object

In [8]:
df['year'] = df['Datetime_format'].apply(lambda i: i.year)
df['month'] = df['Datetime_format'].apply(lambda i: i.month)
df['day'] = df['Datetime_format'].apply(lambda i: i.day)
df['dayofweek'] = df['Datetime_format'].apply(lambda i: i.dayofweek)
df['dayofyear'] = df['Datetime_format'].apply(lambda i: i.dayofyear)
df['day_name'] = df['Datetime_format'].apply(lambda i: i.day_name())
df['month_name'] = df['Datetime_format'].apply(lambda i: i.month_name())

In [10]:
def weekend_logic(x):
    
    if x == 'Saturday' or x == 'Sunday':
        i = 'weekend'
    else:
        i = 'weekday'
        
    return i

In [11]:
df['day_type'] = df['day_name'].apply(lambda i: weekend_logic(i))

In [12]:
df.head()

,ID,Datetime,Count,Datetime_format,year,month,day,dayofweek,dayofyear,day_name,month_name,day_type
0,0,25-08-2012 00:00,8,2012-08-25 00:00:00,2012,8,25,5,238,Saturday,August,weekend
1,1,25-08-2012 01:00,2,2012-08-25 01:00:00,2012,8,25,5,238,Saturday,August,weekend
2,2,25-08-2012 02:00,6,2012-08-25 02:00:00,2012,8,25,5,238,Saturday,August,weekend
3,3,25-08-2012 03:00,2,2012-08-25 03:00:00,2012,8,25,5,238,Saturday,August,weekend
4,4,25-08-2012 04:00,2,2012-08-25 04:00:00,2012,8,25,5,238,Saturday,August,weekend

In [15]:
type(df.loc[0,'Datetime_format'])

pandas._libs.tslibs.timestamps.Timestamp

In [13]:
datetime.datetime.today()

datetime.datetime(2022, 5, 15, 19, 0, 1, 515694)

In [14]:
type(datetime.datetime.today())

datetime.datetime

In [16]:
pd.to_datetime(datetime.datetime.today())

Timestamp('2022-05-15 19:00:42.587898')

In [18]:
type(pd.to_datetime(datetime.datetime.today()))

pandas._libs.tslibs.timestamps.Timestamp

In [19]:
df['today'] = pd.to_datetime(datetime.datetime.today())

In [20]:
df.head()

,ID,Datetime,Count,Datetime_format,year,month,day,dayofweek,dayofyear,day_name,month_name,day_type,today
0,0,25-08-2012 00:00,8,2012-08-25 00:00:00,2012,8,25,5,238,Saturday,August,weekend,2022-05-15 19:01:41.983332
1,1,25-08-2012 01:00,2,2012-08-25 01:00:00,2012,8,25,5,238,Saturday,August,weekend,2022-05-15 19:01:41.983332
2,2,25-08-2012 02:00,6,2012-08-25 02:00:00,2012,8,25,5,238,Saturday,August,weekend,2022-05-15 19:01:41.983332
3,3,25-08-2012 03:00,2,2012-08-25 03:00:00,2012,8,25,5,238,Saturday,August,weekend,2022-05-15 19:01:41.983332
4,4,25-08-2012 04:00,2,2012-08-25 04:00:00,2012,8,25,5,238,Saturday,August,weekend,2022-05-15 19:01:41.983332

In [21]:
df['days_passed'] = df['today'] - df['Datetime_format']

In [22]:
df.head()

,ID,Datetime,Count,Datetime_format,year,month,day,dayofweek,dayofyear,day_name,month_name,day_type,today,days_passed
0,0,25-08-2012 00:00,8,2012-08-25 00:00:00,2012,8,25,5,238,Saturday,August,weekend,2022-05-15 19:01:41.983332,3550 days 19:01:41.983332
1,1,25-08-2012 01:00,2,2012-08-25 01:00:00,2012,8,25,5,238,Saturday,August,weekend,2022-05-15 19:01:41.983332,3550 days 18:01:41.983332
2,2,25-08-2012 02:00,6,2012-08-25 02:00:00,2012,8,25,5,238,Saturday,August,weekend,2022-05-15 19:01:41.983332,3550 days 17:01:41.983332
3,3,25-08-2012 03:00,2,2012-08-25 03:00:00,2012,8,25,5,238,Saturday,August,weekend,2022-05-15 19:01:41.983332,3550 days 16:01:41.983332
4,4,25-08-2012 04:00,2,2012-08-25 04:00:00,2012,8,25,5,238,Saturday,August,weekend,2022-05-15 19:01:41.983332,3550 days 15:01:41.983332

In [27]:
a = df.iloc[0,-1]
a

Timedelta('3550 days 19:01:41.983332')

In [26]:
# datetime.datetime.today() + datetime.timedelta(5)

In [28]:
a.days

3550

In [29]:
df['day_passed_no'] = df['days_passed'].apply(lambda i: i.days)
df.head()

,ID,Datetime,Count,Datetime_format,year,month,day,dayofweek,dayofyear,day_name,month_name,day_type,today,days_passed,day_passed_no
0,0,25-08-2012 00:00,8,2012-08-25 00:00:00,2012,8,25,5,238,Saturday,August,weekend,2022-05-15 19:01:41.983332,3550 days 19:01:41.983332,3550
1,1,25-08-2012 01:00,2,2012-08-25 01:00:00,2012,8,25,5,238,Saturday,August,weekend,2022-05-15 19:01:41.983332,3550 days 18:01:41.983332,3550
2,2,25-08-2012 02:00,6,2012-08-25 02:00:00,2012,8,25,5,238,Saturday,August,weekend,2022-05-15 19:01:41.983332,3550 days 17:01:41.983332,3550
3,3,25-08-2012 03:00,2,2012-08-25 03:00:00,2012,8,25,5,238,Saturday,August,weekend,2022-05-15 19:01:41.983332,3550 days 16:01:41.983332,3550
4,4,25-08-2012 04:00,2,2012-08-25 04:00:00,2012,8,25,5,238,Saturday,August,weekend,2022-05-15 19:01:41.983332,3550 days 15:01:41.983332,3550

In [30]:
df.dtypes

ID                           int64
Datetime                    object
Count                        int64
Datetime_format     datetime64[ns]
year                         int64
month                        int64
day                          int64
dayofweek                    int64
dayofyear                    int64
day_name                    object
month_name                  object
day_type                    object
today               datetime64[ns]
days_passed        timedelta64[ns]
day_passed_no                int64
dtype: object

In [32]:
df2 = pd.read_csv(r'datasets/time_series_2.csv')

In [33]:
df2.head()

   ID      Datetime  Count
0   0  25 Aug 2012       8
1   1  25 Aug 2012       2
2   2  25 Aug 2012       6
3   3  25 Aug 2012       2
4   4  25 Aug 2012       2

In [35]:
df2.dtypes

ID           int64
Datetime    object
Count        int64
dtype: object

In [36]:
b = df2.iloc[0, 1]
b

'25 Aug 2012 '

In [37]:
b.strip()

'25 Aug 2012'

In [39]:
df2['Datetime'] = df2['Datetime'].apply(lambda i: i.strip())
df2.head()

   ID     Datetime  Count
0   0  25 Aug 2012      8
1   1  25 Aug 2012      2
2   2  25 Aug 2012      6
3   3  25 Aug 2012      2
4   4  25 Aug 2012      2

In [40]:
b = df2.iloc[0, 1]
b

'25 Aug 2012'

In [41]:
pd.to_datetime(b)

Timestamp('2012-08-25 00:00:00')

In [44]:
pd.to_datetime(b, format = '%d %b %Y')

Timestamp('2012-08-25 00:00:00')

In [45]:
df2['Datetime_format'] = pd.to_datetime(df2['Datetime'], format = '%d %b %Y')

In [46]:
df2.head()

   ID     Datetime  Count Datetime_format
0   0  25 Aug 2012      8      2012-08-25
1   1  25 Aug 2012      2      2012-08-25
2   2  25 Aug 2012      6      2012-08-25
3   3  25 Aug 2012      2      2012-08-25
4   4  25 Aug 2012      2      2012-08-25

In [47]:
c = '2011 08 24'

In [48]:
pd.to_datetime(c)

Timestamp('2011-08-24 00:00:00')

In [50]:
d = datetime.datetime.strptime(c, '%Y %m %d')
d

datetime.datetime(2011, 8, 24, 0, 0)

In [52]:
d.strftime('%b %d, %Y')

'Aug 24, 2011'

In [54]:
df2.head()

   ID     Datetime  Count Datetime_format
0   0  25 Aug 2012      8      2012-08-25
1   1  25 Aug 2012      2      2012-08-25
2   2  25 Aug 2012      6      2012-08-25
3   3  25 Aug 2012      2      2012-08-25
4   4  25 Aug 2012      2      2012-08-25

In [55]:
df2.dtypes

ID                          int64
Datetime                   object
Count                       int64
Datetime_format    datetime64[ns]
dtype: object

In [56]:
df2['Asian_timezone'] = df2['Datetime_format'].dt.tz_localize('Asia/Calcutta')

In [57]:
df2.head()

   ID     Datetime  Count Datetime_format            Asian_timezone
0   0  25 Aug 2012      8      2012-08-25 2012-08-25 00:00:00+05:30
1   1  25 Aug 2012      2      2012-08-25 2012-08-25 00:00:00+05:30
2   2  25 Aug 2012      6      2012-08-25 2012-08-25 00:00:00+05:30
3   3  25 Aug 2012      2      2012-08-25 2012-08-25 00:00:00+05:30
4   4  25 Aug 2012      2      2012-08-25 2012-08-25 00:00:00+05:30

In [59]:
df2['UTC_timezone'] = df2['Asian_timezone'].dt.tz_convert('UTC')

In [60]:
df2.head()

,ID,Datetime,Count,Datetime_format,Asian_timezone,UTC_timezone
0,0,25 Aug 2012,8,2012-08-25,2012-08-25 00:00:00+05:30,2012-08-24 18:30:00+00:00
1,1,25 Aug 2012,2,2012-08-25,2012-08-25 00:00:00+05:30,2012-08-24 18:30:00+00:00
2,2,25 Aug 2012,6,2012-08-25,2012-08-25 00:00:00+05:30,2012-08-24 18:30:00+00:00
3,3,25 Aug 2012,2,2012-08-25,2012-08-25 00:00:00+05:30,2012-08-24 18:30:00+00:00
4,4,25 Aug 2012,2,2012-08-25,2012-08-25 00:00:00+05:30,2012-08-24 18:30:00+00:00

In [61]:
df2.iloc[0,-2]

Timestamp('2012-08-25 00:00:00+0530', tz='Asia/Calcutta')

In [62]:
df2.iloc[0,-1]

Timestamp('2012-08-24 18:30:00+0000', tz='UTC')

In [63]:
df3 = pd.read_csv(r'datasets/data_with_timestamp.csv')

In [64]:
df3.head()

   ID   timestamp  Count
0   0  1345852800      8
1   1  1345856400      2
2   2  1345860000      6
3   3  1345863600      2
4   4  1345867200      2

In [66]:
df3.dtypes

ID           int64
timestamp    int64
Count        int64
dtype: object

In [68]:
df3['datetime_format'] = pd.to_datetime(df3['timestamp'], unit = 's')

In [69]:
df3.head()

   ID   timestamp  Count     datetime_format
0   0  1345852800      8 2012-08-25 00:00:00
1   1  1345856400      2 2012-08-25 01:00:00
2   2  1345860000      6 2012-08-25 02:00:00
3   3  1345863600      2 2012-08-25 03:00:00
4   4  1345867200      2 2012-08-25 04:00:00